#+TITLE: Emacs configuration
#+STARTUP: indent

Literate Emacs configuration. This file is intended to be tangled with
the ~make.el~ script in this repository, and installed with GNU stow.

This file requires the variable "system" to be set and a few
functions/macros created by calling the relevant block in
[[file:dotfiles.org][dotfiles.org]].

* Packaging setup
  :PROPERTIES:
  :header-args: :tangle "emacs/.emacs.d/init.el" :mkdirp yes
  :END:

Package.el is really slow and MELPA only tracks the latest git
version; if it has unreasonable dependencies the package becomes
uninstallable.

Let's try switching to elpaca; it's really fast and in principle
allows us to install from arbitrary Git commits. (But it didn't work
when I tried it with =paperless=, the aforementioned
bad-dependencies-MELPA package...)

This is the boilerplate to install elpaca if unavailable and configure it:

#+begin_src elisp
(defvar elpaca-installer-version 0.6)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (call-process "git" nil buffer t "clone"
                                       (plist-get order :repo) repo)))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
#+end_src

#+RESULTS:
We also need to disable package.el in the "early-init" file
#+begin_src elisp :tangle emacs/.emacs.d/early-init.el
  (setq package-enable-at-startup nil)
#+end_src

Install use-package support and block the queue to ensure it is
available in subsequent setup.

The dependency management for elpaca-use-package seems to be broken
for MELPA version as key-chord version is not set correctly. To work
around this I made a fork of key-chord which sets the Version metadata
properly. I suppose when the other config bugs are sorted out here it
may be worth opening a PR to fix it, but I'm not sure if there is anyone at
"emacsorphanage" to accept bug fixes?

#+begin_src elisp
  (elpaca use-package)
  (elpaca-wait)

  (elpaca elpaca-use-package
          (elpaca-use-package-mode)
          (setq elpaca-use-package-by-default t))

  (elpaca '(key-chord :host github :repo "ajjackson/key-chord" :branch "0.6-versioned"))

  (elpaca-wait)
  (use-package use-package
    :elpaca nil
    :custom
    (use-package-verbose nil)
    (use-package-compute-statistics nil)
    (use-package-always-defer t)
    (use-package-expand-minimally t)
    (use-package-enable-imenu-support t))

  (use-package use-package-chords
    :demand t
    :config
    (key-chord-mode 1))
  (elpaca-wait)

#+end_src

(use-package ships with bind-key, which is actually a pretty neat tool
its own right and I should use in this config. It provides some nice
tools for overriding commands more explicitly and/or limiting
keybindings to certain modes. [[https://github.com/jwiegley/use-package/blob/master/bind-key.el][See source header]]

** Themes
Use similar logic as for font sizes to set different theme
defaults for different machines. Fallback to tango-dark as this
should be generally available (and is pretty nice!)

If solarized is chosen, use elpaca to install it. The project warns
that MELPA should be treated as unstable, so we prefer to use
"non-gnu-elpa" instead. This is lower priority than MELPA in elpaca so
we get the recipe and pass it explicitly.

Because elisp macros do not evaluate their arguments before running,
it is slightly tricky to make sure elpaca sees its arguments as a
recipe in the appropriate format. The trick used here is selective
quoting/unquoting with =`= and =,=: by wrapping in an ~eval~ we ensure
the macro does not run until the inner function has been evaluated.

#+begin_src elisp :results output none

  (let* ((system-preferred-themes
          '(("Angel.local" . solarized)
            ("Angel.lan" . solarized)
            ("Angel" . solarized)
            ("ajj-mbp-1" . solarized)
            ("scpc041.esc.rl.ac.uk" . tango-dark)
            ("Arctopus" . deeper-blue)))
         (preferred-theme
          (cdr (assoc system-name system-preferred-themes)))
         )
    (cond
     ;; No theme if running in a terminal; follow terminal colours
     ((not (display-graphic-p)) nil)

     ;; Install solarized if necessary, then load
     ((equal preferred-theme 'solarized)
      (eval `(elpaca
                 ,(assoc 'solarized-theme (elpaca-menu-non-gnu-elpa 'index))
               (require 'solarized)
               (load-theme 'solarized-dark t)
               )))

     ;; If not solarized, load by name
     (preferred-theme (load-theme preferred-theme t))

     ;; Fall back to a nice theme if none specified
     (t (load-theme 'tango-dark t))))

#+end_src

#+RESULTS:
| elpaca< | elpaca          | elpaca          | (elpaca :repo https://github.com/progfolio/elpaca.git :ref nil :files (:defaults (:exclude extensions)) :build (:not elpaca--activate-package))                                                                                                                                                                                                       | (finished info queueing-deps queued)            | /home/adam/.emacs.d/elpaca/repos/elpaca/          | /home/adam/.emacs.d/elpaca/builds/elpaca          | nil | nil | nil | (:protocol https :inherit t :depth 1 :repo https://github.com/progfolio/elpaca.git :ref nil :files (:defaults (:exclude extensions)) :build (:not elpaca--activate-package) :package elpaca)                                                                                                                                                                                                                                                                                                                                                                                                                                                      | nil | nil | nil | ((emacs 27.1)) | 0 | (25716 52132 941967 295000) | nil | nil | ((finished (25716 52144 370664 909000) ✓ 11.428 secs 0) (info (25716 52144 370568 111000) Adding Info path 0) (queueing-deps (25716 52144 370508 391000) No dependencies to queue 1) (queueing-deps (25716 52144 369851 154000) Queueing Dependencies 1) (queued (25716 52132 923472 26000) Package queued 1))                                                                                                                                                                                                                                                                            | nil |
| elpaca< | solarized-theme | solarized-theme | (solarized-theme :source NonGNU ELPA :url https://github.com/bbatsov/solarized-emacs :description The Solarized color theme :recipe (:package solarized-theme :repo https://github.com/bbatsov/solarized-emacs :url https://github.com/bbatsov/solarized-emacs :files (:defaults (:exclude child-theme-example colorlab dev-emacs.d Cask Makefile)))) | (finished activation info queueing-deps queued) | /home/adam/.emacs.d/elpaca/repos/solarized-emacs/ | /home/adam/.emacs.d/elpaca/builds/solarized-theme | nil | nil | nil | (:package solarized-theme :repo bbatsov/solarized-emacs :fetcher github :files (*.el *.el.in dir *.info *.texi *.texinfo doc/dir doc/*.info doc/*.texi doc/*.texinfo lisp/*.el (:exclude .dir-locals.el test.el tests.el *-test.el *-tests.el LICENSE README* *-pkg.el)) :protocol https :inherit t :depth 1 :source NonGNU ELPA :url https://github.com/bbatsov/solarized-emacs :description The Solarized color theme :recipe (:package solarized-theme :repo https://github.com/bbatsov/solarized-emacs :url https://github.com/bbatsov/solarized-emacs :files (:defaults (:exclude child-theme-example colorlab dev-emacs.d Cask Makefile)))) | nil | nil | nil | ((emacs 24.1)) | 0 | (25716 52144 369745 964000) | nil | nil | ((finished (25716 52144 372070 26000) ✓ 0.002 secs 0) (activation (25716 52144 372025 138000) Autoloads cached 0) (activation (25716 52144 371192 519000) Caching autoloads 0) (activation (25716 52144 371142 93000) Package build dir added to load-path 0) (activation (25716 52144 371089 973000) Activating package 0) (info (25716 52144 371071 248000) No Info dir file found 0) (queueing-deps (25716 52144 371013 204000) No dependencies to queue 1) (queueing-deps (25716 52144 370683 394000) Queueing Dependencies 1) (queued (25716 52144 363778 424000) Package queued 1)) | nil |

If running i3 window manager, get some cool transparent theming up and running.

#+begin_src elisp
  (if (string-equal (getenv "XDG_CURRENT_DESKTOP") "i3")
      (progn (set-frame-parameter (selected-frame) 'alpha '(90 80))
             (add-to-list 'default-frame-alist '(alpha 90 85))))
#+end_src

